erp3l/src/Catalogs/ПараметрыУчетаФИРСБУ/ПараметрыУчетаФИРСБУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыУчетаФИРСБУ</name>
  <attributes>
    <name>ВидФИ</name>
    <type>
      <types>EnumRef.ВидыФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИ</name>
    <type>
      <types>DefinedType.ФинансовыйИнструмент</types>
    </type>
  </attributes>
  <attributes>
    <name>Актив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетаУчета</name>
    <attributes>
      <name>ВидСчетаФИ</name>
      <type>
        <types>CatalogRef.ВидыСчетовФИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ВидыСчетовФИ/ВидыСчетовФИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыСчетовФИ</name>
  <predefined>
    <items>
      <name>СчетВзаиморасчетов</name>
      <description>Счет взаиморасчетов</description>
    </items>
    <items>
      <name>СчетВзаиморасчетовСПлательщиком</name>
      <description>Счет взаиморасчетов в плательщиком</description>
    </items>
    <items>
      <name>СчетВыбытияНКД</name>
      <description>Счет выбытия НКД</description>
    </items>
    <items>
      <name>СчетДБП</name>
      <description>Счет ДБП</description>
    </items>
    <items>
      <name>СчетДоходовОтПереоценки</name>
      <description>Счет дохода от переоценки</description>
    </items>
    <items>
      <name>СчетДоходовОтВыбытия</name>
      <description>Счет доходов от выбытия</description>
    </items>
    <items>
      <name>СчетНачисленияКомиссий</name>
      <description>Счет начисления комиссий</description>
    </items>
    <items>
      <name>СчетНачисленияКупонов</name>
      <description>Счет начисления купонов</description>
    </items>
    <items>
      <name>СчетНачисленияПроцентов</name>
      <description>Счет начисления процентов</description>
    </items>
    <items>
      <name>СчетНКД</name>
      <description>Счет НКД</description>
    </items>
    <items>
      <name>СчетНоминала</name>
      <description>Счет номинала</description>
    </items>
    <items>
      <name>СчетРасходовОтПереоценки</name>
      <description>Счет расхода от переоценки</description>
    </items>
    <items>
      <name>СчетРасходовОтВыбытия</name>
      <description>Счет расходов от выбытия</description>
    </items>
    <items>
      <name>СчетРБП</name>
      <description>Счет РБП</description>
    </items>
    <items>
      <name>СчетУчетаДисконта</name>
      <description>Счет учета премии / дисконта</description>
    </items>
    <items>
      <name>СчетУчетаДисконтаПлательщика</name>
      <description>Счет учета премии / дисконта плательщика</description>
    </items>
    <items>
      <name>СчетУчетаФИ</name>
      <description>Счет учета финансового инструмента</description>
    </items>
  </predefined>
  <tabularSections>
    <name>ВидыФИ</name>
    <attributes>
      <name>ВидФИ</name>
      <type>
        <types>EnumRef.ВидыФинансовыхИнструментов</types>
      </type>
    </attributes>
    <attributes>
      <name>Актив</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидимостьВДокументах</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ПараметрыУчетаФИРСБУ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьПоУмолчанию(ЗаменятьУстановленные = Истина, ОбновитьВидыСчетовФИ = Истина) Экспорт
	
	Если ОбновитьВидыСчетовФИ Тогда
		Справочники.ВидыСчетовФИ.ОбновлениеПредопределенных();	
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВидыСчетовФИВидыФИ.Ссылка КАК ВидСчетаФИ,
	|	ВидыСчетовФИВидыФИ.ВидФИ КАК ВидФИ,
	|	ВидыСчетовФИВидыФИ.Актив КАК Актив,
	|	ВидыСчетовФИВидыФИ.Счет КАК Счет
	|ПОМЕСТИТЬ втВидыФИ
	|ИЗ
	|	Справочник.ВидыСчетовФИ.ВидыФИ КАК ВидыСчетовФИВидыФИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПараметрыУчетаФИРСБУ.Ссылка) КАК ПараметрыУчетаФИ,
	|	ПараметрыУчетаФИРСБУ.ВидФИ КАК ВидФИ,
	|	ПараметрыУчетаФИРСБУ.Актив КАК Актив
	|ПОМЕСТИТЬ втСозданныеПараметры
	|ИЗ
	|	Справочник.ПараметрыУчетаФИРСБУ КАК ПараметрыУчетаФИРСБУ
	|ГДЕ
	|	(ПараметрыУчетаФИРСБУ.ВидФИ, ПараметрыУчетаФИРСБУ.Актив) В
	|			(ВЫБРАТЬ
	|				втВидыФИ.ВидФИ,
	|				втВидыФИ.Актив
	|			ИЗ
	|				втВидыФИ КАК втВидыФИ)
	|	И ПараметрыУчетаФИРСБУ.Ссылка.ФИ = НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ПараметрыУчетаФИРСБУ.ВидФИ,
	|	ПараметрыУчетаФИРСБУ.Актив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВидыФИ.ВидФИ КАК ВидФИ,
	|	втВидыФИ.Актив КАК Актив,
	|	втВидыФИ.ВидСчетаФИ КАК ВидСчетаФИ,
	|	СчетаУчета.ПараметрыУчетаФИ КАК ПараметрыУчетаФИ,
	|	втВидыФИ.Счет КАК Счет
	|ИЗ
	|	втВидыФИ КАК втВидыФИ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСозданныеПараметры КАК СчетаУчета
	|		ПО втВидыФИ.ВидФИ = СчетаУчета.ВидФИ
	|			И втВидыФИ.Актив = СчетаУчета.Актив
	|ИТОГИ
	|	МАКСИМУМ(ПараметрыУчетаФИ)
	|ПО
	|	ВидФИ,
	|	Актив");
	
	ВыборкаВидФИ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВидФИ.Следующий() Цикл
		ВыборкаПараметрыУчетаФИ = ВыборкаВидФИ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПараметрыУчетаФИ.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаПараметрыУчетаФИ.ПараметрыУчетаФИ) Тогда
				Объект = ВыборкаПараметрыУчетаФИ.ПараметрыУчетаФИ.ПолучитьОбъект();
				
				КэшСтарых = Объект.СчетаУчета.Выгрузить();
				КэшСтарых.Индексы.Добавить("ВидСчетаФИ");
				Объект.СчетаУчета.Очистить();
				
			Иначе 
				Объект = Справочники.ПараметрыУчетаФИРСБУ.СоздатьЭлемент();
				Объект.УстановитьНовыйКод();
				ЗаполнитьЗначенияСвойств(Объект, ВыборкаПараметрыУчетаФИ);
				
				КэшСтарых = Объект.СчетаУчета.Выгрузить();
				
			КонецЕсли;
						
			ВыборкаВидСчета = ВыборкаПараметрыУчетаФИ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);			
			ЕстьИзменения = КэшСтарых.Количество() <> ВыборкаВидСчета.Количество();
			Пока ВыборкаВидСчета.Следующий() Цикл
				
				СтрокаТаб = Объект.СчетаУчета.Добавить();
				
				СтрокаСтарая = КэшСтарых.Найти(ВыборкаВидСчета.ВидСчетаФИ, "ВидСчетаФИ");
				Если СтрокаСтарая = Неопределено Тогда
					СтрокаТаб.ВидСчетаФИ = ВыборкаВидСчета.ВидСчетаФИ;
				Иначе
					ЗаполнитьЗначенияСвойств(СтрокаТаб, СтрокаСтарая);					
				КонецЕсли;
				
				Если СтрокаТаб.Счет = ВыборкаВидСчета.Счет Тогда
					Продолжить;// счет не был изменен
				КонецЕсли;
				
				ЕстьИзменения = Истина;
				СтрокаТаб.Счет = ВыборкаВидСчета.Счет;
				Для каждого СтрокаВид Из ВыборкаВидСчета.Счет.ВидыСубконто Цикл
					
					ИмяКолонки = "Субконто" + СтрокаВид.НомерСтроки;
					
					СтрокаТаб[ИмяКолонки] = СтрокаВид.ВидСубконто.ТипЗначения.ПривестиЗначение(СтрокаТаб[ИмяКолонки]);
					
				КонецЦикла;
								
			КонецЦикла;
			
			Если ЕстьИзменения Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
			КонецЕсли;			
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПеренестиИзРегистра() Экспорт

	

КонецПроцедуры

#КонецЕсли
